/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Main {
    public static int number = 25;

    public static void main(String[] args) {
        System.out.println(number*number);
    }
}
