/* 
Задача:
Написать функцию, которая вычисляет минимум из трёх чисел.
Требования:
•	Программа должна выводить текст на экран.
•	Метод min не должен выводить текст на экран.
•	Метод main должен вызвать метод min четыре раза.
•	Метод main должен выводить на экран результат работы метода min. Каждый раз с новой строки.
•	Метод min должен возвращать минимальное значение из чисел a, b и с.
*/
// ------------------------------------------------------------------------

public class Main {
    
    public static int min(int a, int b, int c) {
        if (a>b) {
            if (b>c) return c;
            else if (a==b) {
                if (a>c) return c;
                else return a;
            }
            else return b;
        }
        else return a;
    }
    public static void main(String[] args) {
        System.out.println(min(1, 2, 3));
        System.out.println(min(-1, -2, -3));
        System.out.println(min(3, 5, 3));
        System.out.println(min(5, 5, 10));
    }
}
